get phone soap

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://www.cisco.com/AXL/API/12.5">
   <soapenv:Header/>
   <soapenv:Body>
      <ns:getPhone sequence="?">
         <!--You have a CHOICE of the next 2 items at this level-->
         <name>CSFRASAHU</name>
      </ns:getPhone>
   </soapenv:Body>
</soapenv:Envelope>
